---
kind: other
id: Properties.T:Autodesk.Revit.DB.ParameterValueProvider
source: html/b1925191-fcb7-c25e-dfcb-8d8a1f6da92b.htm
---
# ParameterValueProvider Properties

Specifies whether the .NET object represents a valid Revit entity.